---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.NotOneLoopPath3d
source: html/e67ad08a-ceba-10cb-fd8c-459f1a49d217.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.NotOneLoopPath3d Property

More than one loop not allowed.

## Syntax (C#)
```csharp
public static FailureDefinitionId NotOneLoopPath3d { get; }
```